_Rarzrabotki/BASEBuh/InformationRegisters/ОтправкаПолучениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтправкаПолучениеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументыОтправлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументыПолучены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/BASEBuh/InformationRegisters/ОтправкаПолучениеДокументов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДокументыПолученыПриИзменении(Элемент)
	Если Запись.ДатаПолучения=Дата(1,1,1) Тогда
		Запись.ДатаПолучения=ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Типзнч(Запись.Документ) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда   
		Элементы.ДокументыОтправлены.Заголовок = "Відправлено на підпис підзвітній особі";
		Элементы.ДокументыПолучены.Заголовок = "Повернено з підписами підзвітної особи";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//Оповестить("ОтправкаПолучениеДокументов");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОтправкаПолучениеДокументов");
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОтправленыПриИзменении(Элемент)
	Если Запись.ДатаПолучения=Дата(1,1,1) Тогда
		Запись.ДатаОтправки=ТекущаяДата();
	КонецЕсли;

КонецПроцедуры
